import { Injectable, signal } from '@angular/core';
import { TechFeature } from '../models/tech-feature';

@Injectable({
  providedIn: 'root',
})
export class ProblemsService {
  public smartCityProblems = signal<TechFeature[]>([
    {
      title: 'Безопасность и кибератаки',
      icon: '🔓',
      description: 'Системы IoT уязвимы для хакеров.',
      details:
        'Без должной защиты хакеры могут взломать системы управления транспортом, освещением или данными о трафике, создавая угрозу безопасности.',
    },
    {
      title: 'Высокие затраты на внедрение',
      icon: '💰',
      description: 'Разработка и поддержка требуют больших инвестиций.',
      details:
        'Строительство и обслуживание умных технологий требуют крупных финансовых вложений, что делает их доступными только для крупных городов.',
    },
    {
      title: 'Нехватка инфраструктуры',
      icon: '🏗️',
      description: 'Старые коммуникации несовместимы с новыми технологиями.',
      details:
        'Во многих городах инфраструктура устарела, а её обновление требует значительных затрат и времени.',
    },
    {
      title: 'Конфиденциальность данных',
      icon: '🕵️',
      description:
        'Горожане обеспокоены сбором и обработкой персональных данных.',
      details:
        'Множество сенсоров и камер фиксируют передвижения людей и транспортных средств, что может нарушать право на частную жизнь.',
    },
    {
      title: 'Совместимость технологий',
      icon: '🔄',
      description: 'Разные системы не всегда работают вместе.',
      details:
        'Различные компании используют свои стандарты, из-за чего системы освещения, транспорта и безопасности могут не взаимодействовать друг с другом.',
    },
  ]);
}
